{"id":121839,"xmlId":"gr.jchrist.gitextender","name":"Git Extender","description":"Git Extender adds an option to <em>Update All</em>\n        local branches tracking a remote for all git roots in the current project<br>\n        Local branches that will be updated are the branches that exist locally and have been configured\n        to track a remote branch.<br>\n        <p><strong>It requires IDE version 2020.3 or higher and Java 8+</strong></p>\n        It tries to fast-forward commits in remote branches to local branches.\n        It can be configured through the settings to attempt a simple merge,\n        if the local branch cannot be merged to the tracked remote using fast-forward only.\n        In this case, if there are conflict errors, the merge will be aborted and an error notification will be shown.\n        The update, then, should be performed manually for the reported branch, in order to resolve the conflicts.\n        Any possible uncommitted changes to the current branch will be stashed<br>\n        After updating a branch, if there were any file changes, they will be displayed in\n        IntelliJ Version Control tab.\n        Currently, the correct list of file changes (updated, created, removed) will be displayed.\n        However, when performing a diff for files in a branch other than the currently checked\n        out, the diff will most probably be incorrect.<br>\n        This plugin is available under <a href=\"http://www.apache.org/licenses/LICENSE-2.0\">Apache License, Version 2.0</a>","tags":["VCS"],"vendor":"JChrist","version":"0.7.0","notes":"<ul>\n            <li>\n                0.7.0: Workaround issue with wrong thread creating the update tree, by disabling showing update tree\n            </li>\n            <li>\n                0.6.0: Fixed plugin display in menu\n            </li>\n            <li>\n                0.5.2: Fixed missing backgroundable task spinning notification and disabled concurrent executions\n            </li>\n            <li>\n                0.5.1: Updated threading model for updating repositories\n            </li>\n            <li>\n                0.5.0: Added an option for removing local branches that were tracking a remote one that was pruned\n            </li>\n            <li>\n                0.4.1:\n                Fix for issue #8: Create UpdateInfoTree from the event dispatch thread\n            </li>\n            <li>\n                0.4.0:\n                For projects with multiple modules as separate Git roots, a dialog will open up,\n                offering the option to select which module(s) to update.\n                Refactored persisted configuration settings.\n            </li>\n            <li>\n                0.3.1: Removed until build version from plugin.xml, so that the plugin is compatible with latest releases\n            </li>\n            <li>\n                0.3.0: Added configuration settings for GitExtender, offering options to control\n                whether it will perform fast-forward-only merges, or if it will attempt simple merge and abort on error.\n                Settings can be accessed via File-&gt;Settings-&gt;Other Settings-&gt;GitExtender Settings.\n                Switched to java 8 support, so running it will require that the IDE runs on java 8\n            </li>\n            <li>\n                0.2.0: Keeping track of updated files, as results to be displayed after updating. ***Requires latest version: 145***\n                The displayed updated files may show invalid/incorrect differences (in the show diff dialog)\n            </li>\n            <li>0.1.3: Changed pull method from rebase to merge, with the --ff-only flag (fast-forward only)</li>\n            <li>0.1.2: Using GitFetcher to fetch and prune remotes and show results before starting the update</li>\n            <li>0.1.1:\n                Changed jdk to 1.7, so that the plugin works with IDEA running with 1.7 jdk\n                Added check if any staged or unstaged changes exist in each repository, in order to stash only if needed</li>\n            <li>0.1:\n                Initial version of Git Extender, with support for updating all local branches\n                tracking a remote of all git roots in the current project,\n                using rebase for all local commits and automatic stashing/popping of uncommitted changes</li>\n        </ul>","dependencies":["com.intellij.modules.lang","com.intellij.modules.vcs","Git4Idea"],"since":"203.0","size":53542,"sourceCodeUrl":"https://github.com/JChrist/gitextender"}