{"id":244271,"xmlId":"com.github.beansoft.iscratch","name":"Notes","description":"\n<p>The most advanced Code Notes tool for Jetbrains IDEs, allows adding code notes/bookmarks without altering the code, supports SQLite local storage or save to Evernote,\n    supports view Evernote notes and images.</p>\n<p>代码笔记是一款超好用的适合程序员在JetBrains产品线使用的代码笔记和书签管理软件, 手不离IDE即可完成创建修改搜索代码笔记功能, 支持 SQLite\n    本地数据库存储或者Evernote存储, 支持阅读Evernote笔记和图片. 详细中文说明请滚动到本页面底部. B站视频:\n    <a href=\"https://www.bilibili.com/video/BV1YW4y1y7DP\">IDEA超好用的代码笔记插件 - Notes,\n        国产插件就是牛</a></p>\n<p>为庆祝简体中文版的发布, 国内用户加QQ群 209711104, 新用户立享5折优惠并不定期送一年免费优惠码.</p>\n<p><br>\n    For more info about the Evernote support, please click <a href=\"https://plugins.jetbrains.com/plugin/17501-notes/sync-with-evernote\">Sync with Evernote</a>.\n    In editor notes creation(Alt+M) or from the editor gutter's context menu,\n    create or edit notes, or start by select some code and then using the Alt + Enter intention and the note will display in place.\n    Better than bookmarks: smart display linked source file path and supports key navigation - using up/down key to change, press Enter key\n    or double click to open the linked file, press Esc key Go to main editor (from tool window).\n    Quick notes create in the Notes/Evernote window. Supports for all language files as\n    the Jetbrains IDE supports, full <a href=\"https://plugins.jetbrains.com/plugin/7793-markdown\">Markdown</a>\n    | <a href=\"https://plugins.jetbrains.com/plugin/7391-asciidoc\">AsciiDoc</a>\n    | <a href=\"https://plugins.jetbrains.com/plugin/8045-idea-mind-map\">IDEA Mind Map</a> |\n    <a href=\"https://plugins.jetbrains.com/plugin/7017-plantuml-integration\">PlantUML integration</a> capabilities,\n    provides powerful organization and search features, add and edit code notes and link to source file without altering the source file.<br>\n    Helps you build your personal coding knowledge-base, and makes sure it is always at the ready for use. <br>\n    It is aiming to be a single tool for saving your day to day working notes, snippets of code, and just a good helper when you are working on some complex projects.</p>\n<h2>Save, edit, find and reuse code snippets\n    and notes straight from your IDE<br>\n</h2>\n<p>Right click in editor to add a code Notes or using editor intentions by first\n    select some codes, or just right click in the editor gutter, after that, you can see favorite icons in the editor gutter, there you can edit the title or delete it.</p>\n<p>A Notes tool window will be created in the bottom of your IDE, there you can manually add remove virtual folder, create and edit any type of programming language code fragments.</p>\n<p>Notes is still in active development so it'll be pleasure if you have issues or suggestions.</p>\n\n<p><strong> Main Features</strong></p>\n<ul>\n    <li>Save on the fly when you typing in the editor or change the title</li>\n    <li>Support read-only Java class file and libray source code notes mark</li>\n    <li>Virtual code tree navigation and Full Size window mode code scratches editing</li>\n    <li>Support same code fragments across multiple running IDEs at the same machine(such as WebStorm, Android Studio and IDEA)</li>\n    <li>Speed search : Find just the right code when you need it</li>\n    <li>Editor with the syntax highlighting up to 300 file types</li>\n    <li>Support code highlighting and smart editing as many programming languages as the IDE supports plus third-party extensions\n        such as: <a href=\"https://plugins.jetbrains.com/plugin/8045-idea-mind-map\">IDEA Mind Map</a>,\n        <a href=\"https://plugins.jetbrains.com/plugin/7017-plantuml-integration\">PlantUML integration</a>, Scala and Rust</li>\n    <li>Markdown with preview mode(with Intellij Markdown plugin installed and\n        run with <a href=\"https://github.com/JetBrains/JetBrainsRuntime\">JetBrains Runtime</a> )</li>\n    <li>Easily backup since only one SQLite db file is created</li>\n    <li>Favorite code notes from editor<br>\n\n</li></ul>\n<p><strong> Editor</strong></p>\n<p>Built by developer, for developers. Supports all major programming languages, plus a\n    syntax highlighting for 300 programming languages powered by the\n    <a href=\"https://macromates.com/textmate/manual/bundles\">TextMate\n        bundles</a> in JetBrains IDE in total including all IDE editor features:</p>\n<ul>\n    <li>Reader mode</li>\n    <li>Showing of line numbers</li>\n    <li>Jump to referenced source file</li>\n    <li>Run code scratches(* only Java supported so far and need disable the Reader Mode)</li>\n</ul>\n<p><strong> Local Storage</strong></p>\n<p>Notes is the offline-first application, it is designed to keep your data safe, and nothing will be sent\n    to the internet when you using SQLite, you can backup and copy the single notes.db file use any 3rd-party file-based sync services or  with a USB stick.</p>\n<p><strong> Sync with Evernote</strong></p>\nThis mode all your code notes are store and sync with Evernote(internet connection required).\nDon't forget to click the \"Refresh\" button in the Evenote tool window when you edit the content in a Evernote Application.<br>\nSupports view web pages clipped with Evernote web clipper and picture data attached to your notes without ever having to leave your IDE.<br>\nYou can ignore pictures to speed up your notes display speed.<br>\nThe Evernote integration is still in development, any suggestion or bug report is welcome!\n<br>\n\n<h1><a>Chinese Documents Below</a> 中文说明文档</h1>\n<p>欲了解更多Evernote 集成的相关信息, 请点击\n    <a href=\"https://plugins.jetbrains.com/plugin/17501-notes/sync-with-evernote\">\n        Evernote同步</a>.\n    在文件编辑器内一键创建(快捷键Alt+M或者选择代码后按下 Alt+Enter 组合键), 或通过编辑器行号区域右键点击快速创建笔记, 修改和删除代码笔记,\n    记录下的笔记将会在编辑器内实时显示.\n    更好用的书签功能: 智能显示笔记链接的源文件, 支持键盘导航 -&nbsp; 使用上下箭头切换条目, 按下回车键或者双击条目打开链接的文件,\n    按下ESC键返回主编辑器(从代码笔记小窗口离开). 在代码笔记/Evernote 工具窗口中快速创建笔记.&nbsp; 支持Jetbrains开发工具所能支持的所有编程语言文件,\n    完全支持 <a href=\"https://plugins.jetbrains.com/plugin/7793-markdown\">Markdown</a> |\n    <a href=\"https://plugins.jetbrains.com/plugin/7391-asciidoc\">AsciiDoc</a>\n    | <a href=\"https://plugins.jetbrains.com/plugin/8045-idea-mind-map\">IDEA Mind Map</a> |\n    <a href=\"https://plugins.jetbrains.com/plugin/7017-plantuml-integration\">PlantUML\n        插件集成</a> 能力,&nbsp; 强大的组织和搜索功能,&nbsp; 修改代码笔记并链接到源文件而无需对源文件做任何修改. <br>\n    祝你创造个人代码知识库,&nbsp; 在敲代码时无需离开IDE打断心流随时随手可用. <br>\n    只需要单一插件, 即可保存你的每日工作笔记, 代码片段, 成为你在复杂项目中工作时大展身手的小助手.<br>\n</p>\n<h2>从IDE中直接增删改查复用代码片段和代码笔记</h2>\n<p>在编辑器中或在编辑器行号区域, 右键点击添加到代码笔记或者选择代码使用编辑器意图(Alt+Enter)出发之后, 你可在编辑器隔条中看到笔记图标, 点击图标即可修改标题或者删除笔记.</p>\n<p>在开发工具底部会出现一个<strong>代码笔记</strong>工具窗口, 在此小窗中可手工添加或者删除虚拟文件夹,\n    创建和修改任意类型的编程语言代码笔记和代码片段.</p>\n<p>代码笔记仍处于持续开发中, 欢迎提出问题或者建议.</p>\n\n<p><strong>主要功能</strong><br>\n</p>\n<ul>\n    <li>自动保存! 在编辑器中或者修改标题时会实时保存内容</li>\n    <li>支持对只读的库文件或者Java类文件上直接添加笔记</li>\n    <li>虚拟代码树结构以及全屏窗口模式及代码片段修改</li>\n    <li>支持相同的代码笔记在同一台电脑上的运行中的多个开发工具中(例如 WebStorm, Android Studio 和IDEA)同时展示</li>\n    <li>极速搜索: 快速找到你所需要的正确代码</li>\n    <li>语法高亮编辑器支持多达300种编程语言类型</li>\n    <li>支持多种编程语言的代码高亮和智能编辑模式, 除IDE内置语言外还支持第三方扩展编程语言例如:\n        <a href=\"https://plugins.jetbrains.com/plugin/8045-idea-mind-map\">IDEA Mind Map</a>,\n        <a href=\"https://plugins.jetbrains.com/plugin/7017-plantuml-integration\">PlantUML integration</a>, Scala\n        和 Rust</li>\n    <li>Markdown 编辑和预览(需要安装Intellij Markdown 插件并运行于<a href=\"https://github.com/JetBrains/JetBrainsRuntime\">JetBrains\n        Runtime</a> )</li>\n    <li>易于备份同步, 整个代码笔记仅需一个SQLite 数据库文件进行存储</li>\n    <li>从编辑器中收藏代码笔记</li>\n\n</ul>\n\n<p><strong> 编辑器</strong></p>\n<p>程序员开发, 为了程序员. 支持所有主流编程语言, 外加 300 种编程语言的语法高亮(通过使用JetBrains IDE中内置的<a href=\"https://macromates.com/textmate/manual/bundles\">TextMates 包</a>)并支持所有IDE编辑器功能:</p>\n<ul>\n    <li>阅读器模式</li>\n    <li>显示行号</li>\n    <li>跳转到引用的源代码文件</li>\n    <li>直接运行代码片段(* 仅支持 Java 语言并且需要禁用阅读器模式)</li>\n\n</ul>\n<p><strong> 本地存储</strong><br>\n    代码笔记是离线优先的应用, 它从设计之初就考虑到数据安全, 当你使用SQLite模式时, 不会有任何数据被发送到网上, 你可备份并复制同步单个 notes.db\n    文件, 可使用任何第三方同步网盘或者使用U盘备份.</p>\n<p><strong> 同步到印象笔记/Evernote</strong></p>\n在此模式下所有代码笔记会存储并同步到Evernote或者印象笔记(需要联网在线). <br>\n当在Evernote或者印象笔记中修改了笔记内容时,\n请不要忘了在开发工具的Evernote工具窗口中点击\"刷新\"按钮.<br>\n无需离开IDE即可浏览Evernote或者印象笔记中通过浏览器剪藏功能收藏的网页, 正确显示富文本内容和图片.<br>\nEvernote/印象笔记集成功能仍在持续迭代中, 欢迎反馈问题或者建议!\n\n<h2>Getting started</h2>\nLaunch the IDE and open Settings, search for \"Notes\" and click install, then restart your IDE if prompted.\n<br>\n\t中国用户加群5折 QQ群: 209711104","organization":"BeanSoft","tags":["Tools Integration","Productivity","Paid"],"vendor":"BeanSoft","version":"2022.2.10","notes":"\n        <br>2022.2.10\n        <br>-New: Allow filter out only current project's virtual folder when create/edit notes\n        <br>-New: Allow adding notes without select any code and right-click at editor gutter to add a note\n        <br>-Bug fix: Java source code can't highlight variable name in readonly source code\n        <br>-Bug fix: Line number doesn't move correctly\n        Bug修复: 只读Java库源码中的变量名没有正确高亮显示\n        <br>2022.2.9\n        <br>-New feature: the note follows the correct code line number\n        <br>-Improvement: Sort Evernote books by name asc\n        <br>-Fix a problem, note title in trash can't be edited in editor anymore\n        <br>-新功能: 笔记跟随代码功能, 正确自动更新行号\n        <br>-改进: 印象笔记的笔记本现在可以根据名字自动排序\n        <br>-若干修复: 废纸篓中的笔记现在不能在编辑器分隔区中被修改了\n        <br>2022.2.8\n        <br>-Fix bug #11 Crashed Selecting Database for IntelliJ Notes Plugin\n        <br>-Disable Notes tool window editor's float action as it cause some text can't be shown: format code, hide error\n        <br>2022.2.7\n        <br>-New Feature: Focus Only Notes in Current Project, in this mode only display Notes that created with current project's source files\n        <br>2022.2.6\n        <br>-Fix some minor bugs.\n        <br>-Add Simplified Chinese display language for plugin UI.\n        <br>2022.2.5\n        <br>-Using TextMate Bundles plugin to supports syntax highlighting for file types that not supported natively by IDE, up to 300 file types supported.\n        <br>-Optimize language list display with file extension shown aside.\n        <br>2022.2.4\n        <br>-Fix bugs that sometimes the visual editor crashes: https://github.com/beansoft/iscratch-support/issues/12.\n        <br>-Add support for Jetbrains 2022.2 EAP/Beta\n        <br>2022.2.3\n        <br>-New: Supports Wysiwyg design mode rich text notes create and edit. This feature doesn't support 2022.2 EAP, I'm still working on bug fix for that version.\n        <br>2022.2.2\n        <br>-New: Open Evernote source url in tool window / IDE's web browser / external web browser\n        <br>-Improve Notes' linked source file name display effect\n        <br>-Fix some bugs in Evernote tool window\n        <br>2022.2.1\n        <br>-Fix bug that can't press Esc key to hide the notes add/edit dialog\n        <br>-Improve the virtual folder display\n        <br>-New: Support display all Evernote HTML content(viewer only), supports switch off picture or only show code notes\n        <br>2022.2.0\n        <br>-Fix bug that can't create notes on class file\n        <br>-Add settings option to disable the gutter icon and the line end comments for Notes and iNotes\n        <br>-Fix bug that the line number is always off-by-one when edit in Notes/iNotes tool window\n        <br>2022.1.5\n        <br>-Fix bug Plugin Crashed (Issue #10)\n        <br>2022.1.4\n        <br>-Better than bookmarks: smart display linked source file path and supports key navigation - using up/down key to change, press Enter key\n        or double click to open the linked file, press Esc key Go to editor (from tool window);\n        <br>-Fix plugin crash issue with IDEA/WebStorm 2022.1 beta;\n        <br>-Fix IDE hang issue when database failed to init when input some invalid database path, see https://github.com/beansoft/iscratch-support/issues/9.\n        <br>2022.1.3\n        <br>-Fix plugin crash issue with IDEA/WebStorm 2022.1 EAP 3\n        <br>2022.1.2\n        <br>-Fix issue in settings page that when clicking the generate Evernote Developer Tokens link now open correct page in browser\n        <br>2022.1.1\n        <br>-Add experimental sync with Evernote integration(in iNotes tool window)\n        <br>-Fix memory leak in the embed code editor\n        <br>2022.1.0\n        <br>-Fix Issue #1, support some languages without default extension such as Dockerfile\n        <br>-Fix Issue #7, Crashes with latest version of Webstorm 2021.1\n        <br>-Fix focus traversal issue when pressing tab key can't move the code editor area\n        <br>-Fix some window focus issue when work with multi-project\n        <br>-New: Support modify editor, tree and list font in the Notes window, click Settings &gt; Tools &gt; Notes\n        <br>-New: Toggle to hide editor red errors in the Notes window\n        <br>-New: Add trash bin, can move note to trash, restore, delete permanently or empty the trash\n        <br>-New: Paste Html from Clipboard to Markdown, try copy something from Slack or web browser\n        <br>-Improve: Save and restore the editing note after project opened\n        <br>-New: Allow locate to note in the editor's note edit dialog\n        <br>-Improve: Add context menu to list and tree\n        <br>2021.1.1\n        <br>-Fix search notes issue in \"Search Everywhere\" dialog and in the notes list (which is introduced in 2021.1.0 EAP version);\n        <br>-Add keyboard shortcuts to some dialog and action;\n        <br>-Fix a bug that editor popup menu \"Add Selection to Notes\" doesn't work as expected;\n        <br>-Confirm before delete a note;\n        <br>-Dialog auto focus improvement;\n        <br>-Disabled code editor's error stripe.\n        <br>2021.1.0 EAP\n        <br>-A big update that changes plugin's main interface and name to \"Notes\", please report issue in case you found.\n        <br>-Fix plugin crash issue for WebStorm/IDEA 2021.3.1.\n        <br>2020.3.9\n        <br>-dark theme opt\n        <br>2020.3.8\n        <br>-Support Alt + Enter intention to edit notes in editor\n        <br>-Note now displayed in editor at the end of your code(easy to reading now)<br>\n        <br>2020.3.7\n        <br>-Allow quick add a note in Notes window\n        <br>2020.3.6\n        <br>-Fix Bug report: Crash on task switch (Issue #3)\n        <br>2020.3.5\n        <br>-Add Markdown editor toolbar inside Notes window when running with IDEA 2021\n        <br>-Fix Window focus problem with AsciiDoc plugin (Issue #2), now Notes editor toolbar works OK with AsciiDoc file\n        <br>-Fix typo\n        <br>2020.3.4\n        <br>-Add search everywhere tab entry\n        <br>2020.3.3\n        <br>-Fix an issue that when old notes line number exceeds current file editor's max line number, plugin crashes\n        <br>-Fix an issue can't save new linked file line number after edit\n        <br>2020.3.2\n        <br>-Fix an issue can't save new linked file path after edit\n        <br>2020.3.1\n        <br>-First release and Update compatible version(2021.1 and later)\n        ","dependencies":["com.intellij.modules.platform","com.intellij.modules.lang","org.jetbrains.plugins.textmate"],"optionalDependencies":["org.intellij.plugins.markdown","org.asciidoctor.intellij.asciidoc"],"since":"203.6682.168","until":"222.*","size":12997697,"productCode":"PISCRATCH"}