{"id":251654,"xmlId":"app.teamhub","name":"GitLive","description":"<h1> Code, review, merge, repeat</h1>\n<h2>Development teams merge faster with <strong> GitLive</strong> </h2>\n\n<br>\n\n<a href=\"https://git.live/video\">\n<img src=\"https://uploads-ssl.webflow.com/6033cf9dce54c65d97d57571/636d01a3d471f91da582bf6d_IJ-poster.png\">\n</a>\n\n<p>GitLive helps you and your fellow contributors merge faster by avoiding conflicts and encouraging eager and continuous code review directly inside the IDE.</p>\n<br>\n\n<h2>Do not let merge conflicts break your flow</h2>\n<p><strong>Indicators in the gutter of your editor show the changes others are making.</strong> Computed from all active branches, the indicators update as you and your team code together.</p>\n<p><strong>Get notified the moment you make a change that conflicts with another branch.</strong> Compare their changes to your own and cherry‑pick individual changes directly into your local files.</p>\n\n<br>\n\n<p><img src=\"https://uploads-ssl.webflow.com/6033cf9dce54c65d97d57571/636cd31d04bf297ed6d5732d_MC-JB-540x380.gif\"></p>\n\n<br>\n\n\n<h2>Get the ultimate perspective on all work in progress</h2>\n<p><strong>Perform eager and continuous code review directly in your IDE with the team view.</strong> See who is online, their active branches and changes in a single repository or across your organization, updated in real‑time.</p>\n<p><strong>Get notified when you fall behind the main branch or your tracking branch.</strong> Inspect the changed files in the repository view to know if they will merge cleanly with your own local changes before you pull.</p>\n<br>\n<p><img src=\"https://uploads-ssl.webflow.com/6033cf9dce54c65d97d57571/636cd6f7f20a6a16f5f5994b_TT-JB-540x380.gif\"></p>\n\n<br>\n\n<h2>Let your team know what you are working on</h2>\n<p><strong>Connect your issue tracker to see each other's current issue in the team view.</strong> The issue you are working on is determined by your current branch and updates automatically.</p>\n<p><strong>View your current issue and select another issue to work on via the status bar.</strong> Switching issues will check out an existing feature branch or create a new one for you if needed.</p>\n<br>\n<p><img src=\"https://uploads-ssl.webflow.com/6033cf9dce54c65d97d57571/636cd318baa7572f311835ff_IT-JB-540X380.gif\"></p>\n\n<br>\n\n<h2>Supported platforms</h2>\n<ul>\n    <li>Interoperable between VS Code and all JetBrains IDEs</li>\n    <li><span>Supported services:</span> GitHub, GitLab, GitLab Self Hosted, Bitbucket &amp; Azure DevOps</li>\n</ul>\n<br>\n<h2>Want to learn more?</h2>\n<p>Check out <a href=\"https://blog.git.live\">blog.git.live</a> for the latest updates</p>\n<h2>Getting started</h2>\n<ul>\n<li> Install GitLive plugin from the marketplace (VSCode, JetBrains)</li>\n<li> Open a repository from one of the supported cloud services (GitHub, GitLab, Bitbucket, Azure DevOps)</li>\n<li> If you are the first in your team to sign in you will be prompted to install the GitLive app on your cloud service and grant the necessary permissions</li>\n</ul>\n<br>\n<p>Please reach out to support@git.live if you use a different repository hosting service.</p>","tags":["TeamWork"],"vendor":"GitLive","version":"16.0.1","notes":"<strong>16.0.1</strong>\n<br>\n<p>Fixed 404 on opening links on GitLab.com</p>\n<p>Fixed an error after checking out an issue in Azure</p>\n<p>Fixed default branch name not updating in the team view</p>\n<p>Fixed an error when clicking on \"Open file in Azure\" from the team view</p>\n<p>Fixed the forever \"Opening file..\" message when opening a diff</p>\n<p>Fixed an issue causing an \"Unsupported\" error notification to appear</p>\n<p>Fixed checking out a detached head when switching branches via issue popup </p>\n<br>\n\n<strong>16.0.0</strong>\n<br>\n<p>New feature: The Repository View</p>\n<ul>\n    <li>By default, the GitLive sidebar now shows all the branches ahead of your local in the tree grouped by contributor, so you can easily see the changes from others relative to your current branch </li>\n    <br>\n    <li>Also by default, if you are signed in, the branches will include any local changes made in a clone of the repository by other signed-in contributors</li>\n    <br>\n    <li>If you are behind the remote branch your local branch is tracking or the default branch, these will show at the top level of the tree</li>\n    <br>\n    <li>New tree view options let you change what is shown in the repository view:</li>\n    <ul>\n        <li>You can see the changes relative to the <b>common ancestor</b> between your local branch and theirs (the default) or relative to <b>their remote branch</b> meaning you would only see changes not yet pushed to the remote</li>\n        <li>The changes can also be restricted to <b>their remote branch</b> meaning you would only see the changes pushed to the remote, or <b>their working tree</b> which would include unpushed changes</li>\n    </ul>\n    <li>Also, new diff view options let you change what is shown in the diff view:</li>\n    <ul>\n        <li>Just like the tree view options you can change the left-hand side of the diff between the <b>common ancestor</b> and <b>their remote branch</b> and the right-hand side between <b>their remote branch</b> and <b>their working tree</b></li>\n        <li>The diff view options also support changing the left-hand side to <b>your working tree</b> which allows you to see the changes compared to your local version of the file and easily cherry-pick individual changes to your file</li>\n        <li>The right-hand side view options are also available for your local files open in the main editor to change what is shown in the gutter</li>\n    </ul>\n    <li> Finally, you can select which repository to show if your workspace contains more than one repository via the team navigation button. Here you can also select the organization for a repository to see all the branches ahead of the default branch grouped by a contributor for every repository in the organization (this was the only view in the previous version of the extension)</li>\n</ul>\n<br>\n<p>NOTE: As this is a major version update make sure your whole team upgrades, all team members need to use the same major version of the plugin otherwise you may find some features do not work correctly.</p>\n<br>\n\n<strong>15.0.11</strong>\n<br>\n<p>More performance improvements</p>\n<br>\n<strong>15.0.10</strong>\n<br>\n<p>Various performance and memory enhancements</p>\n<br>\n<strong>15.0.9</strong>\n<br>\n<p>Fixed error when computing the gutter indicators</p>\n<p>Fixed intermittent error on start up</p>\n<br>\n<strong>15.0.8</strong>\n<br>\n<p>Fixed an edge case that could cause increased network activity</p>\n<br>\n<strong>15.0.7</strong>\n<br>\n<p>Added support for gutter conflicts for new unpushed files</p>\n<p>Fixed follow cursor not switching off when changing files during codeshare</p>\n<p>Fixed crash when signing out of last account</p>\n<p>Fixed link for custom self-hosted URL not showing</p>\n<p>Fixed gutter indicators showing unpushed changes when hide files was on</p>\n<p>Fixed bug not allowing working copies to be deleted</p>\n<br>\n<strong>15.0.6</strong>\n<br>\n<p>Fixed crash on startup in 2022.X IDEs</p>\n<br>\n<strong>15.0.5</strong>\n<br>\n<p>Fixed mismatch hash error causing codeshare session to fail</p>\n<p>Fixed unpushed changes not always showing in the gutter</p>\n<p>Fixed filters causing no files to show</p>\n<p>Fixed sign in link not working when there were no branches ahead of the default branch</p>\n<br>\n<strong>15.0.0</strong>\n<br>\n<p>New feature: View changes from all branches in the team tree and via the change markers in gutter of the editor</p>\n<ul>\n    <li>The team tree shows every branch ahead of main for each user instead of just their current branch</li>\n    <li>The gutter change indicators show changes from all branches for each user instead of just their current branch</li>\n    <li>Team tree status filters - Filter users (online or offline), branches/issues (todo, in progress, stale) and files (pushed or unpushed).</li>\n    <li>Gutter status filters - Filters change indicators by status (pushed, unpushed, non-conflicting, stale)</li>\n</ul>\n<br>\n<p>Introducing Offline Mode</p>\n<p>The team window and gutter indicators now work offline so you can use them without having to sign-in or install GitLive on your Git hosting provider.</p>\n<p>Also in offline mode only the data from your local Git clone is accessed and nothing is sent outside your network.</p>\n<p>And you can still sign in to go real-time and see your teammate's unpushed changes in the gutter and team window.</p>\n<br>\n<p>NOTE: As this is a major version update make sure your whole team upgrades, all team members need to use the same major version of the plugin otherwise you may find some features do not work correctly.</p>\n<br>\n<strong>14.0.6</strong>\n<br>\n<p>Fixed issue when opening new repository without an initial commit</p>\n<br>\n<strong>14.0.5</strong>\n<br>\n<p>Fixed crash when opening a new project with no branches</p>\n<br>\n<strong>14.0.4</strong>\n<br>\n<p>Fixed an issue causing 'Continue without installing' not to work</p>\n<p>Fixed issue where codesharing with someone without an IDE open would not open the sharing link</p>\n<p>Fixed the Restart IDE button</p>\n<br>\n<strong>14.0.3</strong>\n<br>\n<p>Fixed issue where new files were not displaying the content correctly in the diff view</p>\n<p>Added support for repositories using a ssh host alias in a remote url</p>\n<p>Fixed crash when user opens a project not under git version control</p>\n<p>Fixed issue causing error message \"Failed to load base revision\"</p>\n<p>Fixed issue causing gutter indicators not to show</p>\n<br>\n<strong>14.0.2</strong>\n<br>\n<p>Fixed error on startup preventing plugin from working</p>\n<br>\n<strong>14.0.1</strong>\n<br>\n<p>Fixed crash when showing a diff on a new file</p>\n<p>Fixed crash when creating a file with no extension and no content</p>\n<p>Issue selector supports navigation using just the keyboard</p>\n<p>Fixed issue selector popup sizing issue, would render slightly too small</p>\n<p>Fixed crash when collaborating and sharing a decompiled java class file</p>\n<p>Fixed issue when diff was identical then diff content would show blank instead of the full content of the file</p>\n<p>Fixed issue causing diffs from local clones not to load</p>\n<p>Fixed crash when checking out a detached head</p>\n<br>\n<strong>14.0.0</strong>\n<br>\n<p>Codeshare without calling - You can now start sharing code with a teammate without getting on a call first.</p>\n<p>View a teammate’s pushed changes - you can now choose to see the changes your teammates have pushed in addition to their local changes in the GitLive window.</p>\n<p>OS-level calling notifications - Never miss a call again with push notifications when you receive a call from a teammate.</p>\n<p>Choose where to branch from when starting a new issue - You can see which branch is already connected to an issue or choose which branch to use as a starting point for a new issue when selecting an issue to work on.</p>\n<br>\n<p>NOTE: As this is a major version update make sure your whole team upgrades, all team members need to use the same major version of the plugin otherwise you may find some features do not work correctly.</p>\n<br>\n<strong>13.0.0</strong>\n<br>\n<p>Codeshare stability improvements and various enhancements including option to restrict code sharing to a single open project</p>\n<p>Other notable changes</p>\n<ul>\n    <li>Fixed crash for users who were in a detached head state (no branch)</li>\n    <li>Fixed crash when local hostname fails to resolve</li>\n    <li>Fixed possible Permission denied error on startup</li>\n</ul>\n<br>\n<p>NOTE: As this is a major version update make sure your whole team upgrades, all team members need to use the same major version of the plugin otherwise you may find some features do not work correctly.</p>\n<br>\n<strong>12.1.5</strong>\n<br>\n<p>Fixed an issue with the rendering of gutter preview pane</p>\n<p>Changes will not show in the gutter if you have hidden changes in settings</p>\n<p>Changes from branches deleted on the remote will not show in the gutter</p>\n<br>\n<strong>12.1.4</strong>\n<br>\n<p>Added fix for bottom widget not refreshing</p>\n<p>Added better handling of git failures</p>\n<p>Fixed Gutter popup rendering issues of inline diff</p>\n<br>\n<strong>12.1.2</strong>\n<br>\n<p>Added local git repository refresh when git command fails</p>\n<p>Added fixes for users with intermittent internet connections</p>\n<p>Fixed issue with calling notifications showing again after someone called</p>\n<br>\n<strong>12.1.1</strong>\n<br>\n<p>Fixed a crash with codesharing of a file that was ignored in git</p>\n<br>\n<strong>12.1.0</strong>\n<br>\n<p>Following during codeshare now includes opening the hosts files from outside of the shared repo such as library headers</p>\n<p>You can now associate an issue with a pre-existing branch via the new prompt on checkout of a branch without a connected issue</p>\n<p>Busy status: Other members of your team will now show as busy in the GitLive tab when on a call (and calling them is disabled)</p>\n<p>Other notable changes</p>\n<ul>\n    <li>Fixed file opening on correct line when following during codeshare</li>\n    <li>Gutter popup renders another users changes correctly in the preview</li>\n    <li>Fixed bug where users were unable to add new accounts</li>\n    <li>GitLab self hosted profile images now supported</li>\n    <li>Fixed issue of incorrect url of user profile</li>\n    <li>Fixed issue of rendering of user profile images</li>\n</ul>\n<br>\n<strong>12.0.2</strong>\n<br>\n<p>Fixed selecting issue in issue selector does not do anything</p>\n<br>\n<strong>12.0.1</strong>\n<br>\n<p>Fixed multiple issue causing uncaught exceptions</p>\n<p>Fixed issue with following not working on certain open files</p>\n<p>Improved calling notifications</p>\n<p>Fixed pixelated avatars when calling</p>\n<br>\n<strong>12.0.0</strong>\n<br>\n<p>New feature: Voice and video calling with screen &amp; code share!</p>\n<ul>\n    <li>Make one-to-one calls directly from your editor</li>\n    <li>Screenshare any window or desktop</li>\n    <li>Codeshare to see each others cursors and edit together simultaneously</li>\n    <li>Interoperable between VS Code and all JetBrains IDEs</li>\n</ul>\n<br>\n<p>NOTE: As this is a major version update make sure your whole team upgrades, all team members need to use the same major version of the plugin otherwise you may find some features do not work correctly.</p>\n<br>\n<strong>11.1.2</strong>\n<br>\n<p>Fixed issue with following user whilst collaborating</p>\n<br>\n<strong>11.1.1</strong>\n<br>\n<p>Removed requirement for read access to code via API when installing GitLive on your repository hosting service</p>\n<p>Fixed not all services showing in add account in plugin settings</p>\n<br>\n<strong>11.1.0</strong>\n<br>\n<p>Global setting to hide gutter conflicts</p>\n<p>Added fix for gutter popup being stale</p>\n<p>Fixed bug with excessive new line on the gutter preview</p>\n<p>Fixed issue with gutter icons refreshing excessively</p>\n<p>Fixed issue where conflict markers cover an additional line</p>\n<br>\n<strong>11.0.0</strong>\n<br>\n<p>New feature: Instant merge conflict detection!</p>\n<ul>\n    <li>See other contributor's changes to a file in the gutter of your editor, updated in real-time</li>\n    <li>Conflicts between their version and yours are shown in red</li>\n    <li>Click the change in the gutter to popup the other contributor's branch and connected issue</li>\n    <li>Cherry pick their change from the popup straight into your local file</li>\n</ul>\n<p>Other notable changes</p>\n<ul>\n    <li>Remove your local copy from GitLive via the context menu</li>\n    <li>Fixed synchronization issue whilst collaborating</li>\n</ul>\n<br>\n<p>NOTE: As this is a major version update make sure your whole team upgrades, all team members need to use the same major version of the plugin otherwise you may find some features do not work correctly.</p>\n<br>\n<strong>10.0.5</strong>\n<br>\n<p>Fixed issues with custom GitLab self hosted urls</p>\n<p>Fixed cherry-pick failure on 2020.3</p>\n<br>\n<strong>10.0.4</strong>\n<br>\n<p>Fixed an issue causing an uncaught exception</p>\n<br>\n<strong>10.0.3</strong>\n<br>\n<p>Fixed issues with remote url containing www</p>\n<br>\n<strong>10.0.2</strong>\n<br>\n<p>Fixed issues with custom GitLab self hosted urls</p>\n<br>\n<strong>10.0.1</strong>\n<br>\n<p>Fixed Gitlab self hosted with remotes using ssh</p>\n<br>\n<strong>10.0.0</strong>\n<br>\n<p>This update brings GitLab Self Hosted support!</p>\n<br>\n<p>Once installed, open a repository from your GitLab self-hosted instance in your IDE to get started.</p>\n<br>\n<p>NOTE: As this is a major version update make sure your whole team upgrades, all team members need to use the same major version of the plugin otherwise you may find some features do not work correctly.</p>\n<br>\n<strong>9.0.0</strong>\n<br>\n<p>New feature: Issue tracking</p>\n<ul>\n    <li>The GitLive window now shows which issue each of your teammates' are working on in realtime</li>\n    <li>Share your current issue with your team by selecting an issue to work on</li>\n    <li>See your current issue in the status bar and click to select a new issue</li>\n    <li>Selecting a new issue to work on automatically creates a new branch</li>\n</ul>\n<br>\n<strong>8.0.1</strong>\n<br>\n<p>Fixed possible synchronization issue whilst collaborating</p>\n<br>\n<strong>8.0.0</strong>\n<br>\n<p>Improved the stability of real-time editing, in particular when collaborating across JetBrains &amp; VSCode</p>\n<br>\n<p>NOTE: As this is a major version update make sure your whole team upgrades, all team members need to use the same major version of the plugin otherwise you may find some features do not work correctly.</p>\n<br>\n<strong>7.1.0</strong>\n<br>\n<p>New feature: Cherry pick a teammate's changes directly from their local files! Just right-click their working copy or even just a file in the GitLive window and select Cherry-Pick...</p>\n<br>\n<p>Added support for connecting to Azure DevOps via SSH and remote URLs using the old domain visualstudio.com</p>\n<br>\n<p>Fixed possible synchronization issue whilst collaborating</p>\n<br>\n<strong>7.0.0</strong>\n<br>\n<p>Fixed several uncaught exceptions showing in IDE including Permission denied, INTERNAL and NoClassDefFoundError</p>\n<br>\n<p>NOTE: As this is a major version update make sure your whole team upgrades, all team members need to use the same major version of the plugin otherwise you may find some features do not work correctly.</p>\n<br>\n<strong>6.2.0</strong>\n<br>\n<p>GitHub.com users: You can now use GitLive without having to install the GitLive App on your GitHub organisation! Just make sure your GitHub account is setup correctly in the IDE under Settings -&gt; Version Control -&gt; GitHub </p>\n<br>\n<p>Fixed more synchronization bugs whilst collaborating, including following getting switched off when changing files</p>\n<br>\n<p>Fixed an issue where file changes from unpushed commits would not appear in GitLive</p>\n<br>\n<strong>6.1.0</strong>\n<br>\n<p>Added remote cursor position indicators in right hand gutter</p>\n<br>\n<p>Cursor following now works whilst using the debugger</p>\n<br>\n<p>Fixed issue with sign in on 2020.2 IDEs</p>\n<br>\n<p>Fixed possible synchronization issues whilst collaborating</p>\n<br>\n<strong>6.0.1</strong>\n<br>\n<p>Welcome to GitLive, the new name for TeamHub, this release upgrades our watch feature to full real-time editing! To work on a teammate's files right click their name in the Team Window and select \"Collaborate on their files\"</p>\n<br>\n<p><b>Other changes include:</b></p>\n<br>\n<p>New look TeamHub window with inline diff view</p>\n<br>\n<p>Follow/Unfollow your teammates cursor option when collaborating</p>\n<br>\n<p>New settings for offline mode, hide activity graph, hide working copy changes</p>\n<br>\n<p>New accounts list in settings to view and manage connected repository hosting service accounts</p>\n<br>\n<p>Support for Azure DevOps cloud</p>\n<br>\n<p>Support for 2020 IDEs</p>\n<br>\n<p>NOTE: As this is a major version update make sure your whole team upgrades, all team members need to use the same major version of the plugin otherwise you may find some features do not work correctly.</p>\n<br>  \n<strong>5.0.4</strong>\n<br>\n<p>Fixed Bitbucket installation link</p>\n<br>\n<strong>5.0.3</strong>\n<br>\n<p>Fixed issues with offline, away &amp; online state changes</p>\n<br>\n<strong>5.0.1</strong>\n<br>\n<p>Added support for 2019.3 IDEs</p>\n<br>\n<p>Introducing Incognito Mode</p>\n<br>\n<p>When enabled your teammates cannot view your local changes and will only get notified of potential merge conflicts with your changes once they are pushed. Incognito Mode was designed for when you are working on a spike or experimental change to avoid teammates being needlessly notified about potential merge conflicts with your work in progress.</p>\n<br>\n<p>Support for watching across projects</p>\n<br>\n<p>Prior to this update you could only watch teammates if you had the same project open in your IDE, now you can watch a teammate from any project that contains a repository from the same organization</p>\n<br>\n<p>NOTE: As this is a major version update make sure your whole team upgrades, all team members need to use the same major version of the plugin otherwise you may find some features do not work correctly.</p>\n<br>\n<strong>4.0.3</strong>\n<br>\n<p>Fixed race condition that could cause sign in to fail</p>\n<br>\n<strong>4.0.2</strong>\n<br>\n<p>Restored compatibility with 2018 IDEs</p>\n<br>\n<strong>4.0.1</strong>\n<br>\n<p>This update brings GitLab support!</p>\n<br>\n<p>Once installed, open a repository from GitLab in your IDE to get started.</p>\n<br>\n<p>NOTE: As this is a major version update make sure your whole team upgrades, all team members need to use the same major version of the plugin otherwise you may find some features do not work correctly.</p>\n<br>\n<strong>3.0.1</strong>\n<br>\n<p>This update brings Bitbucket support, once installed, open a repository from Bitbucket in your IDE to get started.</p>\n<br>\n<p>It also includes an important fix for an issue affecting IDEs 2019.2 and later, where teammates files were not being updated so make sure you upgrade if you are using the 2019.2+</p>\n<br>\n<p>NOTE: As this is a major version update make sure your whole team upgrades, all team members need to use the same major version of the plugin otherwise you may find some features do not work correctly.</p>\n<br>\n<strong>2.0.2</strong>\n<br>\n<p>Restored Android Studio compatibility</p>\n<br>\n<strong>2.0.1</strong>\n<br>\n<p>You can now \"watch\" your teammates, to watch make sure you have the same repository open as the teammate you want to watch, then right click them in the team window and select watch.</p>\n<br>\n<p>Watching a teammate will open their current file and show their caret, updating in real-time as they type, scroll and select text. If they change files the new file will automatically open in your IDE also.</p>\n<br>\n<p>Please note currently you cannot edit their files but this feature will be available in a future update coming soon.</p>\n<br>\n<p>NOTE: As this is a major version update make sure your whole team upgrades, all team members need to use the same major version of the plugin otherwise you may find some features do not work correctly.</p>","dependencies":["com.intellij.modules.lang","com.intellij.modules.vcs","Git4Idea"],"optionalDependencies":["org.jetbrains.plugins.github","com.jetbrains.codeWithMe"],"since":"211.6693","size":21169464}